In [4]:
import numpy as np
import pandas as pd

In [5]:
# https://jalammar.github.io/gentle-visual-intro-to-data-analysis-python-pandas/

# Series

In [14]:
# Tek boyutludur
names = ["Ensar","Erva","Muhammed"]
notes = [70,60,65]

In [15]:
result=pd.Series(data=notes, index=names)
print(result)

Ensar       70
Erva        60
Muhammed    65
dtype: int64

In [16]:
notes2 = [10,20,30]
result2=pd.Series(data=notes2, index=names)
print(result2)

Ensar       10
Erva        20
Muhammed    30
dtype: int64

In [19]:
print(result+result2)
print()
print(result-result2)

Ensar       80
Erva        80
Muhammed    95
dtype: int64

Ensar       60
Erva        40
Muhammed    35
dtype: int64

# DataFrame

In [22]:
data = np.random.randn(4,3)
data

array([[ 0.63119655, -0.21139145, -0.95455061],
       [ 0.89844747,  0.39746377, -0.29790942],
       [ 0.37583762,  0.75805498, -1.04917918],
       [ 0.98802126, -1.31542895, -0.76221941]])

In [23]:
data_frame = pd.DataFrame(data)
data_frame

          0         1         2
0  0.631197 -0.211391 -0.954551
1  0.898447  0.397464 -0.297909
2  0.375838  0.758055 -1.049179
3  0.988021 -1.315429 -0.762219

In [25]:
print(type(data_frame))
print(type(data_frame[0]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [26]:
new_data_frame = pd.DataFrame(data, index=["Ensar","Erva","Zümra","Hilal"], columns=["Maaş", "Yaş","Tecrübe"])
new_data_frame

           Maaş       Yaş   Tecrübe
Ensar  0.631197 -0.211391 -0.954551
Erva   0.898447  0.397464 -0.297909
Zümra  0.375838  0.758055 -1.049179
Hilal  0.988021 -1.315429 -0.762219

In [28]:
new_data_frame.iloc[0] # satıra göre arama yapma --> loc[Ensar] da aynısını verir

Maaş       0.631197
Yaş       -0.211391
Tecrübe   -0.954551
Name: Ensar, dtype: float64

# Data Manipulation

In [29]:
new_data_frame["Ekstra"]=10
new_data_frame

           Maaş       Yaş   Tecrübe  Ekstra
Ensar  0.631197 -0.211391 -0.954551      10
Erva   0.898447  0.397464 -0.297909      10
Zümra  0.375838  0.758055 -1.049179      10
Hilal  0.988021 -1.315429 -0.762219      10

In [34]:
new_data_frame.drop("Ekstra", axis=1, inplace=True) # inplace içinde bunu yap , axis=1 demezsen satırı siler
new_data_frame                                      # new_data_frame = new_data_frame.drop("Ekstra",axis=1) de denebilir.

           Maaş       Yaş   Tecrübe
Ensar  0.631197 -0.211391 -0.954551
Erva   0.898447  0.397464 -0.297909
Zümra  0.375838  0.758055 -1.049179
Hilal  0.988021 -1.315429 -0.762219

In [38]:
new_data_frame.loc["Ensar","Maaş"]=100
new_data_frame

             Maaş       Yaş   Tecrübe
Ensar  100.000000 -0.211391 -0.954551
Erva     0.898447  0.397464 -0.297909
Zümra    0.375838  0.758055 -1.049179
Hilal    0.988021 -1.315429 -0.762219

In [43]:
print(new_data_frame[new_data_frame>0])
print()
print(new_data_frame[new_data_frame["Yaş"]>0])

             Maaş       Yaş  Tecrübe
Ensar  100.000000       NaN      NaN
Erva     0.898447  0.397464      NaN
Zümra    0.375838  0.758055      NaN
Hilal    0.988021       NaN      NaN

           Maaş       Yaş   Tecrübe
Erva   0.898447  0.397464 -0.297909
Zümra  0.375838  0.758055 -1.049179

# Read Excel & CSV

In [47]:
weather_df = pd.read_excel('6-weather.xlsx')
weather_df

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [49]:
print(weather_df.head())
print()
print(weather_df.tail())

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20

   Istanbul  New York  Amsterdam  Paris
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [50]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Istanbul   9 non-null      int64
 1   New York   9 non-null      int64
 2   Amsterdam  9 non-null      int64
 3   Paris      9 non-null      int64
dtypes: int64(4)
memory usage: 420.0 bytes

In [54]:
weather_df.describe()

        Istanbul   New York  Amsterdam      Paris
count   9.000000   9.000000   9.000000   9.000000
mean   21.444444  13.111111  16.777778  15.555556
std     3.609401   2.147350   2.538591   2.351123
min    15.000000  10.000000  14.000000  12.000000
25%    20.000000  12.000000  15.000000  14.000000
50%    21.000000  13.000000  16.000000  15.000000
75%    22.000000  15.000000  18.000000  16.000000
max    28.000000  16.000000  22.000000  20.000000

In [56]:
print(weather_df.isna())
print()
print(weather_df.count())

   Istanbul  New York  Amsterdam  Paris
0     False     False      False  False
1     False     False      False  False
2     False     False      False  False
3     False     False      False  False
4     False     False      False  False
5     False     False      False  False
6     False     False      False  False
7     False     False      False  False
8     False     False      False  False

Istanbul     9
New York     9
Amsterdam    9
Paris        9
dtype: int64